000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/УчетнаяПолитикаМагазинов/УчетнаяПолитикаМагазинов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаМагазинов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПодарочныйСертификатКакСкидка</name>
    <comment>иначе - как тип оплпты (типовой механизм)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьПродажуУслуг</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьПродажуТоварОбычный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьПродажуТоварСпециальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеПечататьСлипЧекПриОплате</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольРезерваТовараПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриПроведенииОтправлятьВNavision</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БлокироватьИзменениеСуммыОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УслугаСтрахования</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьВерификациюПокупателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БлокироватьДвиженияПоПересчетуСамостоятельному</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьWEBПередачуОбъектовВЦБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьWEBЗагрузкуЗаказовПокупателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьБанковскиеУслуги</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>CRM_РазрешитьОбменВходящий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>CRM_РазрешитьОбменИсходящий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>CRM_ПродажиАктивированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>CRM_УправлениеЦенниками</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>CRM_ТаймаутРасчетаЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>CRM_ТаймаутКонтрагента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НоменклатуруСегментаФормироватьНаПериферии</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьВнешнююОбработкуРМК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьОкруглениеВЧекеККМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтключитьКонтрольПодарочныхСертификатов</name>
    <comment>Предохранитель многовекторности проверок.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвторасчетНДС_РРО</name>
    <comment>ЧекККМ, ОтчетОРозничныхПродажах.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвторасчетНДС_Прочие</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьNavisionРегламентомОрдерПроведенный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОплатуБонусамиНеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьОтказВерификацииКонтрагента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОграничитьОтгрузкуРеализованногоЗаказаПокупателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтключитьОграниченияПериодаПоКассовомуДню</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Магазин</name>
    <comment>Если пустой - значит, по всем магазинам, для которых НЕТ конкретной записи</comment>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/СоответствияОбъектовУчетныхСистем/СоответствияОбъектовУчетныхСистем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствияОбъектовУчетныхСистем</name>
  <resources>
    <name>УникальныйИдентификаторИсточника</name>
    <comment>Локальный - 1С:Розница</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УникальныйИдентификаторПриемника</name>
    <comment>Внешний - другая система</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчетнаяСистема</name>
    <type>
      <types>EnumRef.УчетныеСистемыКомпании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыРегистрацийMicrosoftDynamics/ТипыРегистрацийMicrosoftDynamics.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРегистрацийMicrosoftDynamics</name>
  <enumValues>
    <name>ДействующиеЦены</name>
  </enumValues>
  <enumValues>
    <name>Документы</name>
  </enumValues>
  <enumValues>
    <name>ЗапросДоступности</name>
  </enumValues>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Магазины</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>СправочникиДругие</name>
  </enumValues>
  <enumValues>
    <name>ТоварыНаСкладах</name>
  </enumValues>
  <enumValues>
    <name>ЦеныНоменклатуры</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/УчетныеСистемыКомпании/УчетныеСистемыКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УчетныеСистемыКомпании</name>
  <enumValues>
    <name>Magento</name>
  </enumValues>
  <enumValues>
    <name>MSDynCRM</name>
  </enumValues>
  <enumValues>
    <name>Navision</name>
  </enumValues>
  <enumValues>
    <name>Розница</name>
  </enumValues>
  <enumValues>
    <name>РозницаТестовая</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипДоставкиЗаказПокупателя/ТипДоставкиЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипДоставкиЗаказПокупателя</name>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>НоваяПочтаДоставкаВОтделение</name>
  </enumValues>
  <enumValues>
    <name>НоваяПочтаДоставкаПоАдресу</name>
  </enumValues>
  <enumValues>
    <name>MeestExpressДоставкаВОтделение</name>
  </enumValues>
  <enumValues>
    <name>MeestExpressДоставкаПоАдресу</name>
  </enumValues>
  <enumValues>
    <name>СлужбаДоставки</name>
  </enumValues>
  <enumValues>
    <name>Смешаный</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ОператорыДоставки/ОператорыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОператорыДоставки</name>
  <enumValues>
    <name>ВнутренняяЛогистика</name>
  </enumValues>
  <enumValues>
    <name>НоваяПочта</name>
  </enumValues>
  <enumValues>
    <name>MeestExpress</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыЗапросовДоступностиТоваров/СтатусыЗапросовДоступностиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗапросовДоступностиТоваров</name>
  <enumValues>
    <name>Подготовить</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отменён</name>
  </enumValues>
  <enumValues>
    <name>Удалён</name>
  </enumValues>
  <enumValues>
    <name>Изменён</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыУслугБанка/ТипыУслугБанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУслугБанка</name>
  <enumValues>
    <name>ОплатаЧастями</name>
  </enumValues>
  <enumValues>
    <name>МгновеннаяРассрочка</name>
  </enumValues>
  <enumValues>
    <name>Кредит</name>
  </enumValues>
  <enumValues>
    <name>ПакетМалыша</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыОплатЧекаККМ/ТипыОплатЧекаККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОплатЧекаККМ</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийКредит</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>Предоплата</name>
  </enumValues>
  <enumValues>
    <name>Послеплата</name>
    <comment>Только для интернет-магазина.</comment>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыЗаказовПокупателей/СтатусыЗаказовПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовПокупателей</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Отменён</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ЗапросДоступности</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/ОбменMicrosoftDynamicsПовтИсп/Module.bsl
//	LNK 03.12.2018 12:56:28
Функция ОбменАктивен(ТипРегистрации = Неопределено)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Возврат НЕ ПолучитьМассивУзлов(ТипРегистрации, Истина).Количество() = 0;

КонецФункции // ОбменАктивен()

//	LNK 19.08.2019 10:28:16
Функция ПолучитьМассивУзлов(ТипРегистрации = Неопределено, ВсеАктивные = Ложь)	Экспорт

	Возврат ОбменMicrosoftDynamicsСервер.ПолучитьМассивУзлов(ТипРегистрации, ВсеАктивные);

КонецФункции

//	LNK 03.12.2019 09:49:44
Функция ПолучитьДанныеУзла(УзелИнформационнойБазы)	Экспорт

	Возврат ПланыОбмена.ОбменMicrosoftDynamics.ПолучитьДанныеУзла(УзелИнформационнойБазы);

КонецФункции

//	\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\/

//	LNK 23.01.2019 14:46:42
Функция ПолучитьИмяМассива(ТипРегистрации)	Экспорт

	Если ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.ДействующиеЦены
	Тогда	ИмяМассива = "products";

	ИначеЕсли ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.ЦеныНоменклатуры
	Тогда	ИмяМассива = "products";

	ИначеЕсли ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.ТоварыНаСкладах
	Тогда	ИмяМассива = "products";

	ИначеЕсли ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.Контрагенты
	Тогда	ИмяМассива = "clients";

	ИначеЕсли ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.Магазины
	Тогда	ИмяМассива = "stores";

	ИначеЕсли ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.Номенклатура
	Тогда	ИмяМассива = "goods";

	ИначеЕсли ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.ЗапросДоступности
	Тогда	ИмяМассива = "requestAvailability";

	ИначеЕсли ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.Документы
	Тогда	ИмяМассива = "sales";

	ИначеЕсли ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.СправочникиДругие
	Тогда	ИмяМассива = "elements";

	Иначе
		
		ВызватьИсключение "нет определения типа регистрации «" + ТипРегистрации + "»";

	КонецЕсли;

	Возврат ИмяМассива;

КонецФункции // ПолучитьИмяМассива()

//	LNK 23.01.2019 14:46:46
Функция ПолучитьИмяПроцедурыWebAPI(ТипРегистрации, ИмяУточнённое = "")	Экспорт

	Если ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.ДействующиеЦены
	Тогда	ИмяПроцедуры = "/api/Prices/SendPrices";

	ИначеЕсли ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.ЦеныНоменклатуры
	Тогда	ИмяПроцедуры = "/api/Prices/UpdatePrices";

	ИначеЕсли ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.ТоварыНаСкладах
	Тогда	ИмяПроцедуры = "/api/Remains/SendRemains";

	ИначеЕсли ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.Контрагенты
	Тогда	ИмяПроцедуры = "/api/HistoryData/SendClientData";

	ИначеЕсли ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.Магазины
	Тогда	ИмяПроцедуры = "/api/Stores/SendStores";

	ИначеЕсли ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.Документы
	Тогда	ИмяПроцедуры = "/api/HistorySales/SendHistorySales";

	ИначеЕсли ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.ЗапросДоступности
	Тогда	ИмяПроцедуры = "/api/Orders/RequestAvailability";

	ИначеЕсли ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.СправочникиДругие
	Тогда	ИмяПроцедуры = "/api/GetDataFrom1C/DifferentData";

	Иначе
		
		ВызватьИсключение "нет определения типа регистрации «" + ТипРегистрации + "»";

	КонецЕсли;

//	\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\/

	Если НЕ ПустаяСтрока(ИмяУточнённое) Тогда

		ИмяПроцедуры = ИмяУточнённое;

	КонецЕсли;

	Возврат ИмяПроцедуры;

КонецФункции

//	LNK 29.07.2019 12:51:02
Функция ИмяПроцедурыWebAPI(ТипРегистрации, ИмяУточнённое = "")	Экспорт

	ПолноеИмяМетода = ОбменMicrosoftDynamicsПовтИсп.ПолучитьИмяПроцедурыWebAPI(ТипРегистрации, ИмяУточнённое);

	Возврат ОбщегоНазначенияКлиентСервер.lx_GetTooken(ПолноеИмяМетода, "/");

КонецФункции

Функция УчетнаяПолитика(Магазин, ГраницаСреза = '00010101')	Экспорт

	Возврат ОбменMicrosoftDynamicsСервер.УчетнаяПолитика(Магазин, ГраницаСреза);

КонецФункции

//	LNK 23.04.2019 13:39:10
Функция МагазинамРазрешенОбменCRM(ГраницаСреза = '00010101')	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Магазины.Ссылка КАК Магазин
	|ИЗ
	|	Справочник.Магазины КАК Магазины
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаМагазинов.СрезПоследних(&ГраницаСреза, Магазин = ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка)) КАК ПолитикаОбщая
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаМагазинов.СрезПоследних(&ГраницаСреза, НЕ Магазин = ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка)) КАК ПолитикаМагазина
	|		ПО Магазины.Ссылка = ПолитикаМагазина.Магазин
	|ГДЕ
	|	НЕ(Магазины.ПометкаУдаления
	|				ИЛИ Магазины.Блокирован
	|				ИЛИ Магазины.СкладУправляющейСистемы)
	|	И Магазины.ВведенВЭксплуатацию
	|	И ЕСТЬNULL(ПолитикаМагазина.CRM_РазрешитьОбменВходящий, ПолитикаОбщая.CRM_РазрешитьОбменВходящий) = ИСТИНА"
	);
	Запрос.УстановитьПараметр("ГраницаСреза", ?(ГраницаСреза = '00010101', ТекущаяДатаСеанса(), ГраницаСреза));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Магазин");

КонецФункции // МагазинамРазрешенОбменCRM()

//	LNK 12.04.2019 11:53:30
Функция ОпределитьТипРегистрации(ПолноеИмя)	Экспорт

	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);

	Если ОбъектМетаданных = Метаданные.РегистрыСведений.ДействующиеЦеныНоменклатуры Тогда
		
		ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.ДействующиеЦены;

	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ЧекККМ
		ИЛИ   ОбъектМетаданных = Метаданные.Документы.ВозвратТоваровОтПокупателя
		ИЛИ   ОбъектМетаданных = Метаданные.Документы.РеализацияТоваров
		ИЛИ	  ОбъектМетаданных = Метаданные.РегистрыСведений.ОбъектУчтенВNavision Тогда
		
		ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.Документы;

	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ЗапросДоступностиТоваров ИЛИ ОбъектМетаданных = Метаданные.РегистрыСведений.СостояниеЗапросаДоступностиТоваров Тогда
		
		ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.ЗапросДоступности;

	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.Контрагенты ИЛИ ОбъектМетаданных = Метаданные.Справочники.ИнформационныеКарты
	ИЛИ ОбъектМетаданных = Метаданные.Документы.ВыдачаДисконтныхКарт ИЛИ ОбъектМетаданных = Метаданные.Документы.ЗаменаДисконтныхКарт	Тогда
		
		ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.Контрагенты;

	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.Магазины ИЛИ ОбъектМетаданных = Метаданные.Справочники.Склады Тогда
		
		ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.Магазины;

	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.Номенклатура Тогда
		
		ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.Номенклатура;

	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыНакопления.ТоварыНаСкладах Тогда
		
		ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.ТоварыНаСкладах;

	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ЦеныНоменклатуры Тогда
		
		ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.ЦеныНоменклатуры;

	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ИменаЛюдей Тогда
		
		ТипРегистрации = Перечисления.ТипыРегистрацийMicrosoftDynamics.СправочникиДругие;

	Иначе
		
		ВызватьИсключение "Нет описания в ТипыРегистрацийMicrosoftDynamics для имени «" + ПолноеИмя + "»";

	КонецЕсли;

	Возврат ТипРегистрации;

КонецФункции // ОпределитьТипРегистрации()

//	LNK 25.07.2019 10:13:59
Функция ИмяСобытияЖурнала(ТипРегистрации = Неопределено, Получение = Ложь)	Экспорт

	Если ЗначениеЗаполнено(ТипРегистрации) Тогда

			Суффикс = "." + ОбщегоНазначенияКлиентСервер.РеквизитПеречисления(ТипРегистрации);

	Иначе	Суффикс = "";
	
	КонецЕсли;

	Возврат "ОбменДанными." + ?(Получение = Истина, "ПолучениеИз", "ВыгрузкаВ") + "MSCRM" + Суффикс;

КонецФункции // ИмяСобытияЖурнала()

//	LNK 16.08.2019 07:06:01
Функция ИдентификаторМагазина(Магазин, Назначение = Неопределено)	Экспорт

	Идентификатор = "";

	Если ЗначениеЗаполнено(Магазин) Тогда

		Если Назначение = Перечисления.УчетныеСистемыКомпании.MSDynCRM Тогда

			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ТаблицаСоответствий.УникальныйИдентификаторПриемника КАК Идентификатор
			|ИЗ
			|	РегистрСведений.СоответствияОбъектовУчетныхСистем КАК ТаблицаСоответствий
			|ГДЕ
			|	ТаблицаСоответствий.Ссылка = &Магазин
			|	И ТаблицаСоответствий.УчетнаяСистема = значение(Перечисление.УчетныеСистемыКомпании.MSDynCRM)"
			);
			Запрос.УстановитьПараметр("Магазин", Магазин);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда

				Идентификатор = Выборка.Идентификатор;

			КонецЕсли;

		Иначе

			Идентификатор = СокрЛП(Магазин.УникальныйИдентификатор());

		КонецЕсли;

	КонецЕсли;

	Возврат Идентификатор;

КонецФункции

#Область НекоторыеФиксированныеПеречисления

Функция КодыТиповДоставки(КлючПоиска)	Экспорт

	ЗначениеВозврата = Новый Соответствие;
	СоставОригинала  = Новый Соответствие;
	СоставОригинала.Вставить(Перечисления.ТипДоставкиЗаказПокупателя.Самовывоз, "100000000");
	СоставОригинала.Вставить(Перечисления.ТипДоставкиЗаказПокупателя.НоваяПочтаДоставкаПоАдресу, "100000001");
	СоставОригинала.Вставить(Перечисления.ТипДоставкиЗаказПокупателя.НоваяПочтаДоставкаВОтделение, "100000002");

	Если НРег(КлючПоиска) = "код" Тогда

		Для каждого КлючЗначение Из СоставОригинала Цикл

			ЗначениеВозврата.Вставить(КлючЗначение.Значение, КлючЗначение.Ключ);

		КонецЦикла;

	Иначе

		ЗначениеВозврата = СоставОригинала;

	КонецЕсли;

	Возврат ЗначениеВозврата;

КонецФункции // КодыТиповДоставки()

Функция КодыОператоровДоставки(КлючПоиска)	Экспорт

	ЗначениеВозврата = Новый Соответствие;
	СоставОригинала  = Новый Соответствие;
	СоставОригинала.Вставить(Перечисления.ОператорыДоставки.ВнутренняяЛогистика, "100000001");
	СоставОригинала.Вставить(Перечисления.ОператорыДоставки.НоваяПочта     , "100000000");

	Если НРег(КлючПоиска) = "код" Тогда

		Для каждого КлючЗначение Из СоставОригинала Цикл

			ЗначениеВозврата.Вставить(КлючЗначение.Значение, КлючЗначение.Ключ);

		КонецЦикла;

	Иначе

		ЗначениеВозврата = СоставОригинала;

	КонецЕсли;

	Возврат ЗначениеВозврата;

КонецФункции // КодыОператоровДоставки()

Функция КодыСтатусовЗапросов(КлючПоиска)	Экспорт

	ЗначениеВозврата = Новый Соответствие;
	СоставОригинала  = Новый Соответствие;
	СоставОригинала.Вставить(Перечисления.СтатусыЗапросовДоступностиТоваров.Подготовить, "");
	СоставОригинала.Вставить(Перечисления.СтатусыЗапросовДоступностиТоваров.Согласован , "100000001");
	СоставОригинала.Вставить(Перечисления.СтатусыЗапросовДоступностиТоваров.Отменён    , "100000005");

	Если НРег(КлючПоиска) = "код" Тогда

		Для каждого КлючЗначение Из СоставОригинала Цикл

			ЗначениеВозврата.Вставить(КлючЗначение.Значение, КлючЗначение.Ключ);

		КонецЦикла;

	Иначе

		ЗначениеВозврата = СоставОригинала;

	КонецЕсли;

	Возврат ЗначениеВозврата;

КонецФункции // КодыОператоровДоставки()

Функция ПолучитьКодТипаОплаты(ТипОплаты, ТипУслугиБанка = Неопределено)	Экспорт

	Если ТипУслугиБанка = Перечисления.ТипыУслугБанка.ОплатаЧастями Тогда

		КодОплаты = "100000005";

	ИначеЕсли ТипУслугиБанка = Перечисления.ТипыУслугБанка.МгновеннаяРассрочка Тогда

		КодОплаты = "100000006";
	
	Иначе

		Если ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта Тогда

			КодОплаты = "100000000";

		ИначеЕсли ТипОплаты = Перечисления.ТипыОплатЧекаККМ.Наличные Тогда

			КодОплаты = "100000001";

		ИначеЕсли ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ПодарочныйСертификат Тогда

			КодОплаты = "100000002";

		Иначе

			КодОплаты = "";

		КонецЕсли;

	КонецЕсли;

	Возврат КодОплаты;

КонецФункции // КодыТиповОплаты()

Функция ПолучитьСтатусЗаказаПокупателя(КодСтатуса)	Экспорт

	Если КодСтатуса = "1" Тогда
		
		Значение = Перечисления.СтатусыЗаказовПокупателей.Закрыт;

	ИначеЕсли КодСтатуса = "0" Тогда
		
		Значение = Перечисления.СтатусыЗаказовПокупателей.Отменён;

	Иначе
		
		Значение = Перечисления.СтатусыЗаказовПокупателей.Согласован;

	КонецЕсли;

	Возврат Значение;

КонецФункции // ПолучитьСтатусЗаказаПокупателя()

Функция ПолучитьСтавкуНДС(СтавкаСтрокой)	Экспорт

	Если СтавкаСтрокой = "20%" Тогда
		
		СтавкаНДС = Перечисления.СтавкиНДС.НДС20;

	ИначеЕсли СтавкаСтрокой = "7%" Тогда
		
		СтавкаНДС = Перечисления.СтавкиНДС.НДС7;

	Иначе
		
		СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
	
	КонецЕсли;

	Возврат СтавкаНДС;

КонецФункции // ПолучитьСтавкуНДС()

Функция ПолДляCRM(ПолСсылка, ТипВозврата = "строка")	Экспорт

	Если НРег(ТипВозврата = "число") Тогда

		ЗначениеВозврата = ?(ПолСсылка = Перечисления.ПолФизическогоЛица.Женский, 0, 1);

	Иначе	//	иначе строка

		ЗначениеВозврата = ?(ПолСсылка = Перечисления.ПолФизическогоЛица.Женский, "female", "male");

	КонецЕсли;

	Возврат ЗначениеВозврата;

КонецФункции

#КонецОбласти
